# Pandas

In [3]:
import pandas as pd

## Series - a one-d labeled array

In [4]:
fruits = ["apple", "pear", "orange", "melon", "kiwi"]
fruits

['apple', 'pear', 'orange', 'melon', 'kiwi']

In [5]:
fruits_pd = pd.Series(["apple", "pear", "orange", "melon", "kiwi"])
fruits

['apple', 'pear', 'orange', 'melon', 'kiwi']

In [6]:
fruits_ind = pd.Series(["apple", "pear", "orange", "melon", "kiwi"], index = [5, 6, "sju", 8, 9])
fruits_ind ["sju"]

'orange'

In [7]:
fruits_ind

5       apple
6        pear
sju    orange
8       melon
9        kiwi
dtype: object

In [8]:
numbers = pd.Series([5, 6, 3])
numbers

0    5
1    6
2    3
dtype: int64

In [9]:
numbers2 = pd.Series([5, "6", 3])
numbers2

0    5
1    6
2    3
dtype: object

In [10]:
numbers*2 +1

0    11
1    13
2     7
dtype: int64

In [11]:
fruits_pd.apply (str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [12]:
fruits_pd[:2]

0    apple
1     pear
dtype: object

In [13]:
fruits_pd[[True, True, False, False, True]]

0    apple
1     pear
4     kiwi
dtype: object

In [14]:
numbers[numbers>=5]

0    5
1    6
dtype: int64

In [15]:
numbers3 =pd.Series([5,9,2,7,6])
numbers3

0    5
1    9
2    2
3    7
4    6
dtype: int64

In [16]:
mask = numbers3>=5
mask
numbers3[mask]

0    5
1    9
3    7
4    6
dtype: int64

## Data Frame

In [17]:
data = {
    "Name": ["Anders", "Thomas", "Mario"],
    "Age": [42, 46, 36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

In [18]:
data = [{"Name": "Anders", "Age": 42},
{"Name": "Thomas", "Age": 46},
{"Name": "Mario", "Age": 36},
]

df2 = pd.DataFrame(data)
df2

     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

In [19]:
df["Name"]

0    Anders
1    Thomas
2     Mario
Name: Name, dtype: object

In [20]:
df["Age"]

0    42
1    46
2    36
Name: Age, dtype: int64

In [21]:
df["Age"] + 1 #doesn't update the df, but returns a new series object

0    43
1    47
2    37
Name: Age, dtype: int64

In [22]:
df["Age"] = df["Age"] + 1 #updates the df
df

     Name  Age
0  Anders   43
1  Thomas   47
2   Mario   37

In [23]:
df["Age"] >= 50

0    False
1    False
2    False
Name: Age, dtype: bool

In [24]:
df[df["Age"]>=50]

Empty DataFrame
Columns: [Name, Age]
Index: []

In [25]:
str(df)

'     Name  Age\n0  Anders   43\n1  Thomas   47\n2   Mario   37'

In [26]:
print(df)

     Name  Age
0  Anders   43
1  Thomas   47
2   Mario   37